coolt/sensortag/bicycle_computer_v4/cc26xxware_2_22_00_16101/driverLib/ssi.h
//*****************************************************************************
//
// Support for DriverLib in ROM:
// Redirect to implementation in ROM when available.
//
//*****************************************************************************
#if !defined(DRIVERLIB_NOROM) && !defined(DOXYGEN)
    #include "../driverLib/rom.h"
    #ifdef ROM_SSIConfigSetExpClk
        #undef  SSIConfigSetExpClk
        #define SSIConfigSetExpClk              ROM_SSIConfigSetExpClk
    #endif
    #ifdef ROM_SSIDataPut
        #undef  SSIDataPut
        #define SSIDataPut                      ROM_SSIDataPut
    #endif
    #ifdef ROM_SSIDataPutNonBlocking
        #undef  SSIDataPutNonBlocking
        #define SSIDataPutNonBlocking           ROM_SSIDataPutNonBlocking
    #endif
    #ifdef ROM_SSIDataGet
        #undef  SSIDataGet
        #define SSIDataGet                      ROM_SSIDataGet
    #endif
    #ifdef ROM_SSIDataGetNonBlocking
        #undef  SSIDataGetNonBlocking
        #define SSIDataGetNonBlocking           ROM_SSIDataGetNonBlocking
    #endif
    #ifdef ROM_SSIIntRegister
        #undef  SSIIntRegister
        #define SSIIntRegister                  ROM_SSIIntRegister
    #endif
    #ifdef ROM_SSIIntUnregister
        #undef  SSIIntUnregister
        #define SSIIntUnregister                ROM_SSIIntUnregister
    #endif
#endif

//*****************************************************************************
//
// Mark the end of the C bindings section for C++ compilers.
//
//*****************************************************************************
#ifdef __cplusplus
}
#endif

#endif // __SSI_H__

//*****************************************************************************
//
//! Close the Doxygen group.
//! @}
//! @}
//
//*****************************************************************************
